---
kind: method
id: M:Autodesk.Revit.DB.Architecture.BalusterPattern.GetBaluster(System.Int32)
source: html/abe74f0f-7ef2-c977-5efb-5a940e9b8df9.htm
---
# Autodesk.Revit.DB.Architecture.BalusterPattern.GetBaluster Method

Gets information about the given baluster from the main baluster pattern.

## Syntax (C#)
```csharp
public BalusterInfo GetBaluster(
	int index
)
```

## Parameters
- **index** (`System.Int32`) - The baluster index.

## Returns
The requested baluster or Nothing nullptr a null reference ( Nothing in Visual Basic) if index is out of range.